init.el

(defun dnw/prompt-date ()
  (let ((date (read-string "Due date: "))
                                          (now  (split-string (format-time-string "%e %B %Y" (current-time)))))
                                      (cond ((equal date "")
                                             (concat now))
                                            ((equal (substring date 0 1) "+")
                                             (concat (number-to-string (+ (string-to-number (car now))
                                                                          (string-to-number (substring date 1))))
                                                     " "
                                                     (cadr now)
                                                     " "
                                                     (caddr now)))
                                            ((= (length date) 2)
                                             (concat date
                                                     " "
                                                     (cadr now)
                                                     " "
                                                     (caddr now))))))

(setq dnw/autoinsert-latex-presets
      '(("Physics" . (nil "\\documentclass{article}\n\n"

                          "\\usepackage[letterpaper]{geometry}\n"
                          "\\usepackage{tgpagella}\n"
                          "\\usepackage{amsmath}\n"
                          "\\usepackage{amssymb}\n"
                          "\\usepackage{amsthm}\n"
                          "\\usepackage{tikz}\n"
                          "\\usepackage{minted}\n"
                          "\\usepackage{physics}\n"
                          "\\usepackage{siunitx}\n\n"

                          "\\sisetup{detect-all}\n"
                          "\\newtheorem{plm}{Problem}\n"
                          "\\renewcommand*{\\proofname}{Solution}\n\n"


                          "\\title{" (read-string "Title: ") "}\n"
                          "\\author{Duncan Wilkie}\n"
                          "\\date{" (dnw/prompt-date) "}\n\n"

                          "\\begin{document}\n\n"

                          "\\maketitle\n\n"

                          -

                          "\n\n\\end{document}"))
        ("Math" . (nil "\\documentclass{article}\n\n"

                          "\\usepackage[letterpaper]{geometry}\n"
                          "\\usepackage{tgpagella}\n"
                          "\\usepackage{amsmath}\n"
                          "\\usepackage{amssymb}\n"
                          "\\usepackage{amsthm}\n"
                          "\\usepackage{tikz}\n"
                          "\\usepackage{minted}\n"
                          "\\usepackage{physics}\n"
                          "\\usepackage{siunitx}\n\n"

                          "\\sisetup{detect-all}\n"
                          "\\newtheorem{plm}{Problem}\n\n"


                          "\\title{" (read-string "Title: ") "}\n"
                          "\\author{Duncan Wilkie}\n"
                          "\\date{" (dnw/prompt-date) "}\n\n"

                          "\\begin{document}\n\n"

                          "\\maketitle\n\n"

                          -

                          "\n\n\\end{document}"))
        ("Default" . ("options, RET: " "\\documentclass[" str & 93 | -1 123
                      (read-string "class: ")
                      "}\n"
                      ("package, %s: " "\\usepackage["
                       (read-string "options, RET: ")
                       & 93 | -1 123 str "}\n")
                      _ "\n\\begin{document}\n"
                      _ "\n\\end{document}"))))

(use-package autoinsert
  :hook (find-file . auto-insert)
  :init
  (setq auto-insert t)
  (setq auto-insert-query nil)
  (auto-insert-mode t)
  :config
  (assoc-delete-all 'latex-mode auto-insert-alist)
  (define-auto-insert 'latex-mode
    (lambda ()
      (let* ((presets (mapcar (lambda (pair) (car pair))
                              dnw/autoinsert-latex-presets))
             (choice (completing-read "Preset:" presets)))
        (skeleton-insert (assoc choice dnw/autoinsert-latex-presets))))))

(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . helpful-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-key] . helpful-key))

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1))

(use-package diminish)

(use-package all-the-icons) ;; requires M-x all-the-icons-install-fonts on first load

(use-package doom-themes
  :init (load-theme 'doom-tomorrow-night t))

(use-package rainbow-delimiters
  :hook ((prog-mode . rainbow-delimiters-mode)
         (LaTeX-mode . rainbow-delimiters-mode)))

(use-package smartparens
  :hook ((prog-mode . smartparens-mode)
         (LaTeX-mode . smartparens-mode)
         (org-mode . smartparens-mode))
  :config
  (require 'smartparens-latex))

(use-package paren
  :config
  (set-face-attribute 'show-paren-match-expression nil :background "#363e4a")
  (show-paren-mode 1))

(setq require-final-newline t)

(use-package ws-butler
  :hook ((text-mode . ws-butler-mode)
         (prog-mode . ws-butler-mode)))

(use-package which-key
  :defer 0
  :diminish which-key-mode
  :config
  (which-key-mode)
  (setq which-key-idle-delay 1))

(defun dnw/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))

(use-package org
  :commands (org-capture org-agenda)
  :hook (org-mode . dnw/org-mode-setup)
  :bind ("C-c C-x C-l" . org-latex-preview)
  :config
  (setq org-ellipsis " ▼")
  (setq org-latex-create-formula-image-program 'imagemagick))
