init.el

(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode))

(with-eval-after-load 'org-faces (dolist (face '((org-level-1 . 1.2)
                                                 (org-level-2 . 1.1)
                                                 (org-level-3 . 1.05)
                                                 (org-level-4 . 1.0)
                                                 (org-level-5 . 1.0)
                                                 (org-level-6 . 1.0)
                                                 (org-level-7 . 1.0)
                                                 (org-level-8 . 1.0)))
                                   (set-face-attribute (car face) nil :font "Liberation Sans" :weight 'regular :height (cdr face)))

                      (set-face-attribute 'fixed-pitch nil :font "Iosevka" :weight 'regular :height 1.0)
                      (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
                      (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
                      (set-face-attribute 'org-table nil :inherit '(shadow fixed-pitch))
                      (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
                      (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
                      (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
                      (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

(setq org-hide-emphasis-markers t)

(use-package org-appear
  :hook (org-mode . org-appear-mode))

(font-lock-add-keywords 'org-mode
                        '(("^ *\\([-]\\) "
                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

(defun dnw/org-mode-visual-fill ()
  (setq visual-fill-column-width 170
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . dnw/org-mode-visual-fill))

(with-eval-after-load 'org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)
     (fortran . t)
     (gnuplot t)
     (R . t)
     (sqlite . t)
     (haskell . t)
     (lua . t)
     (shell . t)
     (C . t)))

  (setq org-confirm-babel-evaluate nil)

  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python3"))
  (add-to-list 'org-structure-template-alist '("ft" . "src fortran"))
  (add-to-list 'org-structure-template-alist '("gp" . "src gnuplot"))
  (add-to-list 'org-structure-template-alist '("sql" . "src sqlite"))
  (add-to-list 'org-structure-template-alist '("r" . "src R"))
  (add-to-list 'org-structure-template-alist '("hs" . "src haskell"))
  (add-to-list 'org-structure-template-alist '("lu" . "src lua"))
  (add-to-list 'org-structure-template-alist '("sys" . "src C")))

(defun dnw/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.emacs.d/config.org"))

  (let ((org-confirm-babel-evaluate nil))
    (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'dnw/org-babel-tangle-config)))

(use-package org-roam
  :ensure t
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "/home/dnw/Roam")
  (org-roam-completion-everywhere t)
  (org-roam-db-node-include-function
   (defun dnw/org-roam-include ()
     (not (member "drill" (org-get-tags)))))
  (org-roam-capture-templates
   '(("d" "default" plain
      "%?"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
      :unnarowed t)
     ("i" "idea" plain
      "* Motivation\n\n%?\n\n* Similar Work\n\n* Feasibility\n\n* Implementation"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Idea")
      :unnarrowed t)
     ("p" "project" plain
      "* Description\n\n%?\n\n** Collaborators\n\n** Stack\n\n* Tasks"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Project")
      :unnarrowed t)
     ("a" "article" plain
      "* Summary\n\n%?\n\n* Context"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Article")
      :unnarrowed t)
     ("m" "musing" plain
      "* %?"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Musing")
      :unnarrowed t)))
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert)
         :map org-mode-map
         ("C-M-i" . completion-at-point))
  :config
  (org-roam-db-autosync-mode))

(use-package org-drill)

(use-package org-present)

(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  :custom ((dired-listing-switches "-ahgo --group-directories-first")))

(use-package dired-single
  :after dired)

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook
  ((c-mode) . lsp)
  ((LaTeX-mode) . lsp)
  (lsp-completion-mode . dnw/lsp-completion)
  :init
  (setq lsp-keymap-prefix "C-c l")
  (defun dnw/lsp-completion ()
    (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
          '(orderless)))
  :config
  (lsp-enable-which-key-integration t)
  :custom
  (lsp-completion-provider :none))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (setq lsp-ui-doc-position 'bottom))


(use-package flycheck
  :defer t
  :hook (lsp-mode . flycheck-mode))

;; (use-package company
;;   :after lsp-mode
;;   :hook (prog-mode . company-mode)
;;   :bind
;;   (:map company-active-map
;;         ("<tab>" . company-complete-selection))
;;   (:map lsp-mode-map
;;         ("<tab>" . company-indent-or-complete-common))
;;   :custom
;;   (company-minimum-prefix-length 1)
;;   (company-idle-delay 0.0))

;; (eval-after-load 'company
;;    '(add-to-list
;;      'company-backends '(company-irony-c-headers
;;                          company-irony
;;                          company-rtags)))


;; (use-package company-box
;;   :hook (company-mode . company-box-mode))

;; (use-package projectile
;;   :diminish projectile-mode
;;   :config (projectile-mode)
;;   :custom ((projectile-completion-system 'ivy))
;;   :bind-keymap
;;   ("C-c p" . projectile-command-map)
;;   :init
;;   (when (file-directory-p "~")
;;     (setq projectile-project-search-path '("~")))
;;   (setq projectile-switch-project-action #'projectile-dired))

;; (use-package counsel-projectile
;;   :config (counsel-projectile-mode))
