init.el

(use-package magit
  :commands (magit-status magit-get-current-branch)
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

;; (use-package yasnippet
;;   :hook ((prog-mode LaTeX-mode) . yas-minor-mode)
;;   :config
;;   (yas-reload-all))

;; (use-package yasnippet-snippets)

(use-package tex
  :ensure auctex
  :config
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq-default TeX-master t)
  (setq LaTeX-command "latex -shell-escape")
  (add-hook 'LaTeX-mode-hook 'visual-line-mode)
  (add-hook 'LaTeX-mode-hook 'flyspell-mode)
  (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
  (setq reftex-plug-into-AUCTeX t)
  (setq TeX-view-program-selection '((output-pdf "Zathura")))
  (setq TeX-electric-sub-and-superscript t))

;; Done from Guix
;; (pdf-loader-install)
;; (use-package pdf-tools
;;   :init
;;   (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)
;;   (pdf-loader-install))

(use-package term
  :commands term
  :config
  (setq explicit-shell-file-name "zsh"))

(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))

(defun dnw/prompt-prefix ()
  (let ((guess (apply
                'concat
                (-map
                 (lambda (x)
                   (if (string= x "dnw")
                        "~/"
                     (concat x "/")))
                 (seq-subseq
                  ;; extra ""'s are to prevent slicing errors
                  (cons "" (cons "" (split-string (eshell/pwd) "/")))
                  -2)))))
    (if (string= guess "home/~/")
        "~"
      (string-remove-suffix "/" guess))))

(remove-hook 'eshell-output-filter-functions
             'eshell-postoutput-scroll-to-bottom)

(defun dnw/prompt ()
  (concat
   (propertize
    (dnw/prompt-prefix)
    'font-lock-face '(:foreground "#4068A3"))
   (propertize " ᛋ" 'font-lock-face '(:foreground "#CB77F9"))
   (propertize " " 'font-lock-face "default")))

(setq eshell-prompt-regexp "^[^ᛋ\n]* ᛋ ")

(setq eshell-highlight-prompt nil
      eshell-prompt-function #'dnw/prompt)

(setq eshell-banner-message "We will reinvent the wheel. They used triangles. 🗿\n\n")

;; (add-to-list eshell-visual-subcommands '("guix" "search"))
;; (add-to-list eshell-visual-subcommands '("guix" "install"))
;; (add-to-list eshell-visual-subcommands '("guix" "remove"))

(setq eshell-destroy-buffer-when-process-dies t)

(setq eshell-prefer-lisp-functions t)
(setq eshell-prefer-lisp-variables t)

;; (use-package notmuch
;;   :config
;;   (setq mail-user-agent 'message-user-agent)
;;   (setq user-mail-address "antigravityd@gmail.com"
;;         user-full-name "Duncan Wilkie")
;;   (setq smtpmail-smtp-server "smtp.gmail.com"
;;         message-mail-send-function 'message-smtpmail-send-it)
;;   (setq smtpmail-debug-info t)
;;   (setq message-default-mail-headers "Cc: \nBcc: \n")
;;   (setq message-auto-save-directory "~/.mail/drafts")
;;   (setq message-kill-buffer-on-exit t)
;;   (setq message-directory "~/.mail/sent")
;;   (setq message-signature "-Duncan Wilkie"))

;; (require 'mu4e)

;; (setq mail-user-agent 'mu4e-user-agent)
;; (setq mu4e-get-mail-command "mbsync -a")

;; (setq user-full-name  "Duncan Wilkie")
;; (setq mu4e-compose-signature  "-Duncan Wilkie")

;; (setq message-kill-buffer-on-exit t)

;; (require 'smtpmail)

;; (setq message-send-mail-function 'smtpmail-send-it)

;; ;;; Call the oauth2ms program to fetch the authentication token
;; (defun fetch-access-token ()
;;   (with-temp-buffer
;;     (call-process "oauth2ms" nil t nil "--encode-xoauth2")
;;     (buffer-string)))

;; ;;; Add new authentication method for xoauth2
;; (cl-defmethod smtpmail-try-auth-method
;;   (process (_mech (eql xoauth2)) user password)
;;   (let* ((access-token (fetch-access-token)))
;;     (smtpmail-command-or-throw
;;      process
;;      (concat "AUTH XOAUTH2 " access-token)
;;      235)))

;; ;;; Register the method
;; (with-eval-after-load 'smtpmail
;;   (add-to-list 'smtpmail-auth-supported 'xoauth2))

;; (setq message-send-mail-function   'smtpmail-send-it
;;       smtpmail-default-smtp-server "smtp.example.com"
;;       smtpmail-smtp-server         "smtp.example.com"
;;       smtpmail-stream-type  'starttls
;;       smtpmail-smtp-service 587)

;; (setq mu4e-contexts
;;       `(,(make-mu4e-context
;;         :name "Personal Gmail"
;;         :enter-func (lambda () (mu4e-message "Switching to Personal Gmail..."))
;;         :match-func  (lambda (msg)
;;                       (when msg
;;                         (string-match-p "/gmail-personal" (mu4e-message-field msg :maildir))))
;;         :vars '((user-mail-address . "antigravityd@gmail.com") ;; set up example Gmail config from manual
;;                 (mu4e-drafts-folder . "/gmail-personal/[Gmail].Drafts")
;;                 (mu4e-sent-folder . "/gmail-personal/[Gmail].Sent Mail")
;;                 (mu4e-trash-folder . "/gmail-personal/[Gmail].Trash")
;;                 (mu4e-sent-messages-behavior . delete)
;;                 (assoc 'mu4e-maildir-shortcuts '((:maildir "/gmail-personal/Inbox" :key ?i)
;;                                             (:maildir "/gmail-personal/[Gmail].Sent Mail" :key ?s)
;;                                             (:maildir "/gmail-personal/[Gmail].Trash" :key ?t)
;;                                             (:maildir "/gmail-personal/[Gmail].All Mail" :key ?a)))
;;                 (starttls-use-gnutls . t)
;;                 (assoc smtpmail-starttls-credentials '(("smtp.gmail.com" 587 nil nil)))
;;                 (assoc smtpmail-auth-credentials  '(("smtp.gmail.com" 587 "antigravityd@gmail.com" nil)))
;;                 (smtpmail-smtp-server . "smtp.gmail.com")
;;                 (smtpmail-smtp-service . 587)))
;;       ,(make-mu4e-context
;;         :name "LSU"
;;         :enter-func (lambda () (mu4e-message "Switching to LSU email..."))
;;         :match-func (lambda (msg)
;;                       (when msg
;;                         (string-match-p "/lsu" (mu4e-message-field msg :maildir))))
;;         :vars '((user-mail-address . "dwilk14@lsu.edu")
;;                 (smtpmail-smtp-server . "smtp-mail.outlook.com")
;;                 (smtpmail-stream-type . starttls)
;;                 (smtpmail-smtp-service . 587)))))
      ;; `(make-mu4e-context
      ;; 	:name "Professional Gmail"
      ;; 	:enter-func (lambda () (mu4e-message "Switching to Professional Gmail..."))
      ;; 	:match-func  (lambda (msg)
      ;; 		       (when msg
      ;; 			 (string= (mu4e-message-field msg :maildir) "/gmail-professional")))
      ;; 	:vars '((user-mail-address . "duncannwilkie@gmail.com")
      ;; 		(user-full-name . "Duncan Wilkie")
      ;; 		(mu4e-compose-signature . "-Duncan Wilkie")))
      ;; `(make-mu4e-context
      ;;   :name "Lab"
      ;;   :enter-func (lambda () (mu4e-message "Switching to Lab email..."))
      ;;   :match-func  (lambda (msg)
      ;;                  (when msg
      ;;                    (string= (mu4e-message-field msg :maildir) "/lab")))
      ;;   :vars '((user-mail-address . "duncan@spartanphysics.com")
      ;;           (user-full-name . "Duncan Wilkie")
      ;;           (mu4e-compose-signature . "-Duncan Wilkie")))

(setq user-mail-address "antigravityd@gmail.com"
      user-full-name "Duncan Wilkie")
