config.org
* Gnus

Email & news reader setup. Time to hit the mailing lists!

#+begin_src emacs-lisp

  (setq user-mail-address "antigravityd@gmail.com"
        user-full-name "Duncan Wilkie")

  (setq gnus-select-method '(nnimap "gmail"
                                    (nnimap-address "imap.gmail.com")
                                    (nnimap-server-port "imaps")
                                    (nnimap-stream ssl)))
  (setq smtpmail-smtp-server "smtp.gmail.com"
        smtpmail-smtp-service 587
        gnus-ignored-newsgroups "^to\\.\\|^[0-9. ]+\\( \\|$\\)\\|^[\"]\"[#'()]")

#+end_src

* ERC

IRC client configuration & QOL changes.

#+begin_src emacs-lisp

  (setq
   erc-nick "FlaminWalrus"
   erc-user-full-name "Duncan W")

  (global-set-key (kbd "C-c e")
                  (lambda ()
                    (interactive)
                    (erc-tls :server "irc.libera.chat"
                             :port "6697")))

#+end_src

* Ement

#+begin_src emacs-lisp

  ;; (package-install 'quelpa-use-package)
  ;; (require 'quelpa-use-package)

  ;; (use-package plz
  ;;   :quelpa (plz :fetcher github :repo "alphapapa/plz.el"))

  ;; (use-package plz
  ;;   :quelpa (plz :fetcher github :repo "alphapapa/plz.el"))

  ;; (use-package ement
  ;;   :quelpa (ement :fetcher github :repo "alphapapa/ement.el"))

#+end_src

* Elfeed

RSS reader configuration.

#+begin_src emacs-lisp


    (defun dnw/elfeed-show-mode-visual-fill ()
      (setq visual-fill-column-width 130
            visual-fill-column-center-text t)
      (visual-fill-column-mode 1))

    (defun dnw/render-latex ()
      (let ((current-prefix-arg '(2)))
        (switch-to-buffer "*elfeed-entry*")
        (call-interactively 'org-latex-preview)))

    (use-package elfeed
      :hook ((elfeed-show-mode . dnw/elfeed-show-mode-visual-fill))
      :config
      (setq elfeed-db-directory (expand-file-name "elfeed" user-emacs-directory)
            elfeed-show-entry-switch 'display-buffer)
      (setq elfeed-feeds
            '("http://feeds.aps.org/rss/allsuggestions.xml"  ;; Physics
              "http://feeds.aps.org/rss/recent/rmp.xml"

              "https://lexi-lambda.github.io/feeds/all.rss.xml" ;; CS
              "https://blog.functorial.com/feed.rss"

              "https://www.ams.org/rss/jams.rss"
              "https://jaireetschahal.substack.com/feed" ;; Math
              "https://golem.ph.utexas.edu/category/atom10.xml"
              "https://homotopytypetheory.org/feed/"

              "https://notrelated.xyz/rss" ;; Misc
              ))
      :bind
      ("C-x w" . elfeed ))


    ;; doesn't function. It'd be really nice to configure this from this orgfile
    ;; (use-package elfeed-org
    ;;   :config
    ;;   (setq elfeed-show-entry-switch 'display-buffer)
    ;;   (setq rmh-elfeed-org-files (list "/home/dnw/.emacs.d/feeds.org")))

#+end_src



* Parsers

#+begin_src emacs-lisp

  ;;(use-package bison-mode)
  (add-to-list 'auto-mode-alist '("\\.g4\\'" . c-mode))

#+end_src

* Haskell

#+begin_src emacs-lisp

  (use-package haskell-mode
    :bind ("C-c C-h" . hoogle)) ;; figure out how to defer loading until .hs is opened?

#+end_src

* TRAMP

#+begin_src emacs-lisp

  ;; TRAMP can't find necessary binaries on Guix machines without this after Emacs 28
  (add-to-list 'tramp-remote-path "/run/current-system/profile/bin")

#+end_src

* Info

#+begin_src emacs-lisp

  (setq Info-use-header-line nil)

#+end_src

* Markdown

#+begin_src emacs-lisp

  (setq markdown-command "pandoc")

#+end_src

* EMMS

Play audio and video.

#+begin_src emacs-lisp

  (use-package emms
    :config
    (emms-all)
    (add-to-list 'emms-player-list 'emms-player-mpd)
    :bind
    ("<XF86AudioPlay>" . emms-start)
    ("<XF86AudioPause>" . emms-pause)
    ("<XF86AudioNext>" . emms-next)
    ("<XF86AudioNext>" . emms-previous))

#+end_src

* HTML

#+begin_src emacs-lisp

  (add-hook 'xhtml-mode-hook (lambda () (call-interactively 'shr-render-buffer)))

#+end_src

* Gnuplot

#+begin_src emacs-lisp

  (use-package gnuplot)
#+end_src

* Desktop Environment

** EXWM

#+begin_src emacs-lisp

  (require 'exwm-xim)
  (require 'exwm-randr)
  (require 'exwm-systemtray)

  (defun dnw/exwm-config ()
    "My configuration of EXWM, adapted from the example."
    ;; Set the initial workspace number.
    (unless (get 'exwm-workspace-number 'saved-value)
      (setq exwm-workspace-number 4))
    ;; Make class name the buffer name
    (add-hook 'exwm-update-class-hook
              (lambda ()
                (exwm-workspace-rename-buffer exwm-class-name)))
    (setq exwm-randr-workspace-output-plist  '(1 "VGA1" 2 "VGA1" 3 "VGA1"))
    (add-hook 'exwm-randr-screen-change-hook
              (lambda ()
                (start-process-shell-command
                 "xrandr" nil "xrandr --output VGA1 --left-of LVDS1 --auto")))

    ;; Global keybindings.
    (unless (get 'exwm-input-global-keys 'saved-value)
      (setq exwm-input-global-keys
            `(
              ;; 's-r': Reset (to line-mode).
              ([?\s-r] . exwm-reset)
              ;; 's-w': Switch workspace.
              ([?\s-w] . exwm-workspace-switch)
              ;; 's-p': Launch application.
              ([?\s-p] . (lambda (command)
                           (interactive (list (read-shell-command "$ ")))
                           (start-process-shell-command command nil command)))
              ;; 's-P': retrieve a password from password store
              ([?\s-P] . password-store-copy)
              ;; 's-N': Switch to certain workspace.
              ,@(mapcar (lambda (i)
                          `(,(kbd (format "s-%d" i)) .
                            (lambda ()
                              (interactive)
                              (exwm-workspace-switch-create ,i))))
                        (number-sequence 0 9)))))
    ;; Line-editing shortcuts
    (unless (get 'exwm-input-simulation-keys 'saved-value)
      (setq exwm-input-simulation-keys
            '(([?\C-b] . [left])
              ([?\C-f] . [right])
              ([?\C-p] . [up])
              ([?\C-n] . [down])
              ([?\C-a] . [home])
              ([?\C-e] . [end])
              ([?\M-v] . [prior])
              ([?\C-v] . [next])
              ([?\C-s] . [C-f])
              ([?\C-d] . [delete])
              ([?\C-g] . [ESC])
              ([?\M-b] . [C-left])
              ([?\M-f] . [C-right])
              ([?\C-k] . [S-end delete])
              ([?\C-w] . [C-x])
              ([?\M-w] . [C-c])
              ([?\C-y] . [C-v])
              ([?\C-/] . [C-z])
              ([?\C-x ?h] . [C-a]))))
    ;; Enable EXWM
    (exwm-enable)
    (exwm-xim-enable)
    (exwm-randr-enable)
    (exwm-systemtray-enable)
    (push ?\C-\\ exwm-input-prefix-keys))

  (use-package exwm
    :config (dnw/exwm-config))

#+end_src

** Pass-mode

#+begin_src emacs-lisp

  (use-package password-store
    :config (pinentry-start))

#+end_src

** EXWM-edit

Edit selected text in org-mode-style source block. It full-screens it at the moment, not sure what that's about.

#+begin_src emacs-lisp

  (use-package exwm-edit)

#+end_src

*  EWW

Primary web browser

#+begin_src emacs-lisp

  (use-package eww
    :config
    (setq browse-url-browser-function 'eww-browse-url)
    (setq eww-search-prefix "https://librex.devol.it/search.php?q=")
    (setq dnw/eww-auto-readable-blacklist '("https://librex.devol.it"))

    (defun dnw/eww-auto-readable ()
      (if (seq-some (lambda (bl) (string-prefix-p bl (eww-current-url)))
                    dnw/eww-auto-readable-blacklist)
          nil
        (eww-readable)))

    (defun dnw/eww-unreadable ()
      (interactive)
      (let ((hook eww-after-render-hook))
        (setq eww-after-render-hook nil)
        (eww-reload t)
        (setq eww-after-render-hook hook))))

    ;; (add-hook 'eww-after-render-hook #'dnw/eww-auto-readable)
    ;; :hook (eww-after-render-hook . dnw/eww-auto-readable) this, for some reason, doesn't work
    ;; :bind ("U" . dnw/eww-unreadable)

#+end_src
* Lean

#+begin_src emacs-lisp

  (use-package lean-mode)

  (use-package company-lean)

#+end_src

* Racket

#+begin_src emacs-lisp

  (use-package racket-mode)

#+end_src

* Guile
#+begin_src emacs-lisp

    (use-package geiser
      :config (require 'geiser-guile))

#+end_src

* Disable Annoying Quail Buffer

#+begin_src emacs-lisp

  (with-eval-after-load 'quail (defun quail-completion ()))

#+end_src
* Runtime Performance

#+begin_src emacs-lisp

  (setq gc-cons-threshold (* 2 1000 1000))

#+end_src
