init.el

(setq gnus-select-method '(nnimap "gmail"
                                  (nnimap-address "imap.gmail.com")
                                  (nnimap-server-port "imaps")
                                  (nnimap-stream ssl)))
(setq smtpmail-smtp-server "smtp.gmail.com"
      smtpmail-smtp-service 587
      gnus-ignored-newsgroups "^to\\.\\|^[0-9. ]+\\( \\|$\\)\\|^[\"]\"[#'()]")

(setq
 erc-nick "FlaminWalrus"
 erc-user-full-name "Duncan W")

(global-set-key (kbd "C-c e")
                (lambda ()
                  (interactive)
                  (erc-tls :server "irc.libera.chat"
                           :port "6697")))

;; (package-install 'quelpa-use-package)
;; (require 'quelpa-use-package)

;; (use-package plz
;;   :quelpa (plz :fetcher github :repo "alphapapa/plz.el"))

;; (use-package plz
;;   :quelpa (plz :fetcher github :repo "alphapapa/plz.el"))

;; (use-package ement
;;   :quelpa (ement :fetcher github :repo "alphapapa/ement.el"))

(defun dnw/elfeed-show-mode-visual-fill ()
  (setq visual-fill-column-width 130
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(defun dnw/render-latex ()
  (let ((current-prefix-arg '(2)))
    (switch-to-buffer "*elfeed-entry*")
    (call-interactively 'org-latex-preview)))

(use-package elfeed
  :hook ((elfeed-show-mode . dnw/elfeed-show-mode-visual-fill))
  :config
  (setq elfeed-db-directory (expand-file-name "elfeed" user-emacs-directory)
        elfeed-show-entry-switch 'display-buffer)
  (setq elfeed-feeds
        '("http://feeds.aps.org/rss/allsuggestions.xml"  ;; Physics
          "http://feeds.aps.org/rss/recent/rmp.xml"

          "https://lexi-lambda.github.io/feeds/all.rss.xml" ;; CS
          "https://blog.functorial.com/feed.rss"

          "https://www.ams.org/rss/jams.rss"
          "https://jaireetschahal.substack.com/feed" ;; Math
          "https://golem.ph.utexas.edu/category/atom10.xml"
          "https://homotopytypetheory.org/feed/"

          "https://notrelated.xyz/rss" ;; Misc
          ))
  :bind
  ("C-x w" . elfeed ))


;; doesn't function. It'd be really nice to configure this from this orgfile
;; (use-package elfeed-org
;;   :config
;;   (setq elfeed-show-entry-switch 'display-buffer)
;;   (setq rmh-elfeed-org-files (list "/home/dnw/.emacs.d/feeds.org")))

;;(use-package bison-mode)
(add-to-list 'auto-mode-alist '("\\.g4\\'" . c-mode))

(use-package haskell-mode
  :bind ("C-c C-h" . hoogle)) ;; figure out how to defer loading until .hs is opened?

;; TRAMP can't find necessary binaries on Guix machines without this after Emacs 28
(add-to-list 'tramp-remote-path "/run/current-system/profile/bin")

(setq Info-use-header-line nil)

(setq markdown-command "pandoc")

(use-package emms
  :config
  (emms-all)
  (add-to-list 'emms-player-list 'emms-player-mpd)
  :bind
  ("<XF86AudioPlay>" . emms-start)
  ("<XF86AudioPause>" . emms-pause)
  ("<XF86AudioNext>" . emms-next)
  ("<XF86AudioNext>" . emms-previous))

(add-hook 'xhtml-mode-hook (lambda () (call-interactively 'shr-render-buffer)))

(use-package gnuplot)

(require 'exwm-xim)
(require 'exwm-randr)
(require 'exwm-systemtray)

(defun dnw/exwm-config ()
  "My configuration of EXWM, adapted from the example."
  ;; Set the initial workspace number.
  (unless (get 'exwm-workspace-number 'saved-value)
    (setq exwm-workspace-number 4))
  ;; Make class name the buffer name
  (add-hook 'exwm-update-class-hook
            (lambda ()
              (exwm-workspace-rename-buffer exwm-class-name)))
  (setq exwm-randr-workspace-output-plist  '(1 "VGA1" 2 "VGA1" 3 "VGA1"))
  (add-hook 'exwm-randr-screen-change-hook
            (lambda ()
              (start-process-shell-command
               "xrandr" nil "xrandr --output VGA1 --left-of LVDS1 --auto")))

  ;; Global keybindings.
  (unless (get 'exwm-input-global-keys 'saved-value)
    (setq exwm-input-global-keys
          `(
            ;; 's-r': Reset (to line-mode).
            ([?\s-r] . exwm-reset)
            ;; 's-w': Switch workspace.
            ([?\s-w] . exwm-workspace-switch)
            ;; 's-p': Launch application.
            ([?\s-p] . (lambda (command)
                         (interactive (list (read-shell-command "$ ")))
                         (start-process-shell-command command nil command)))
            ;; 's-P': retrieve a password from password store
            ([?\s-P] . password-store-copy)
            ;; 's-N': Switch to certain workspace.
            ,@(mapcar (lambda (i)
                        `(,(kbd (format "s-%d" i)) .
                          (lambda ()
                            (interactive)
                            (exwm-workspace-switch-create ,i))))
                      (number-sequence 0 9)))))
  ;; Line-editing shortcuts
  (unless (get 'exwm-input-simulation-keys 'saved-value)
    (setq exwm-input-simulation-keys
          '(([?\C-b] . [left])
            ([?\C-f] . [right])
            ([?\C-p] . [up])
            ([?\C-n] . [down])
            ([?\C-a] . [home])
            ([?\C-e] . [end])
            ([?\M-v] . [prior])
            ([?\C-v] . [next])
            ([?\C-s] . [C-f])
            ([?\C-d] . [delete])
            ([?\C-g] . [ESC])
            ([?\M-b] . [C-left])
            ([?\M-f] . [C-right])
            ([?\C-k] . [S-end delete])
            ([?\C-w] . [C-x])
            ([?\M-w] . [C-c])
            ([?\C-y] . [C-v])
            ([?\C-/] . [C-z])
            ([?\C-x ?h] . [C-a]))))
  ;; Enable EXWM
  (exwm-enable)
  (exwm-xim-enable)
  (exwm-randr-enable)
  (exwm-systemtray-enable)
  (push ?\C-\\ exwm-input-prefix-keys))

(use-package exwm
  :config (dnw/exwm-config))

(use-package password-store
  :config (pinentry-start))

(use-package exwm-edit)

(use-package eww
  :config
  (setq browse-url-browser-function 'eww-browse-url)
  (setq eww-search-prefix "https://librex.devol.it/search.php?q=")
  (setq dnw/eww-auto-readable-blacklist '("https://librex.devol.it"))

  (defun dnw/eww-auto-readable ()
    (if (seq-some (lambda (bl) (string-prefix-p bl (eww-current-url)))
                  dnw/eww-auto-readable-blacklist)
        nil
      (eww-readable)))

  (defun dnw/eww-unreadable ()
    (interactive)
    (let ((hook eww-after-render-hook))
      (setq eww-after-render-hook nil)
      (eww-reload t)
      (setq eww-after-render-hook hook))))

  ;; (add-hook 'eww-after-render-hook #'dnw/eww-auto-readable)
  ;; :hook (eww-after-render-hook . dnw/eww-auto-readable) this, for some reason, doesn't work
  ;; :bind ("U" . dnw/eww-unreadable)

(use-package lean-mode)

(use-package company-lean)

(use-package racket-mode)

(use-package geiser
  :config (require 'geiser-guile))

(with-eval-after-load 'quail (defun quail-completion ()))

(setq gc-cons-threshold (* 2 1000 1000))
